app/controllers/boxfile_controller.rb

UPDATE "users" SET "folder" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["folder", "jVGOqnAr"], ["updated_at", "2014-11-26 04:02:49.068332"]]
---
    def index
        if current_user.folder.nil?
            current_user.folder = generate_random_user_folder_name
            current_user.save